import allure
import pytest

from selenium.webdriver.support.wait import WebDriverWait

from pages import locators
from pages.main_page import MainPage

class TestFAQList:
    @allure.title('По клику на вопросы в выпадающем списке "О важном" открываются ответы')  # декораторы
    @allure.description(
        'проверяем, что каждый вопрос в списке, и ответ на него совпадают с ожидаемым там текстом и соответствуют друг другу')
    @pytest.mark.parametrize('index, question, answer', [
    (0, 'Сколько это стоит? И как оплатить?', 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'),
    (1, 'Хочу сразу несколько самокатов! Так можно?', 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'),
    (2, 'Как рассчитывается время аренды?', 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'),
    (3, 'Можно ли заказать самокат прямо на сегодня?', 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'),
    (4, 'Можно ли продлить заказ или вернуть самокат раньше?', 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'),
    (5, 'Вы привозите зарядку вместе с самокатом?', 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'),
    (6, 'Можно ли отменить заказ?', 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'),
    (7, 'Я жизу за МКАДом, привезёте?', 'Да, обязательно. Всем самокатов! И Москве, и Московской области.')
])
    def test_faq_list(self, index, browser, question, answer):
        main_page = MainPage(browser=browser, url=locators.URL.SCOOTER)
        main_page.open()
        main_page.scroll_to_faq_list()
        WebDriverWait(browser, 3)
        main_page.click_to_faq_question(index)
        assert main_page.is_text_in_faq_question_correct(question)
        assert main_page.is_faq_answer_correct_and_visible(answer)

